hotroom/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
	LeftandRight
	{
		type zeroGradient;
	}
	frontAndBack
	{
		type zeroGradient;
	}
        hot
        {
                type zeroGradient;
        }
        cold
        {
                type zeroGradient;
        }
        inlet
        {
                type fixedValue;
		value $internalField;
        }
	outlet
	{
		type fixedValue;
                value $internalField;
	}

	
}

// ************************************************************************* //
