hotroom/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    LeftandRight
    {
        type            fixedValue;
        value           uniform 300;
    }

    frontAndBack
    {
        type            fixedValue;
        value           uniform 300;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 300;

    }
    outlet
    {
        type            zeroGradient;
    }
    hot
    {
	    type            fixedValue;
        value           uniform 320;
    }
    cold
    {
	    type            fixedValue;
        value           uniform 300;
    }

}

// ************************************************************************* //
